Учет_трудозатрат_EDT/src/Documents/ут_ТехническийПроект/ут_ТехническийПроект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ут_ТехническийПроект</name>
  <registerRecords>AccumulationRegister.ут_УчетПлановыхТрудозатрат</registerRecords>
  <attributes>
    <name>ВнутренняяЗадача</name>
    <type>
      <types>CatalogRef.ут_ЗадачиВнутреннегоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлановыеТрудозатраты</name>
    <attributes>
      <name>Подзадача</name>
      <type>
        <types>CatalogRef.ут_ПодзадачиВнутреннегоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_трудозатрат_EDT/src/AccumulationRegisters/ут_УчетПлановыхТрудозатрат/ут_УчетПлановыхТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ут_УчетПлановыхТрудозатрат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подзадача</name>
    <type>
      <types>CatalogRef.ут_ПодзадачиВнутреннегоУчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_трудозатрат_EDT/src/Documents/ут_ТехническийПроект/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ут_УчетПлановыхТрудозатрат Приход
	Движения.ут_УчетПлановыхТрудозатрат.Записывать = Истина;
	Для Каждого ТекСтрокаПлановыеТрудозатраты Из ПлановыеТрудозатраты Цикл
		Движение = Движения.ут_УчетПлановыхТрудозатрат.Добавить();
		Движение.Период = Дата;
		Движение.Подзадача = ТекСтрокаПлановыеТрудозатраты.Подзадача;
		Движение.План = ТекСтрокаПлановыеТрудозатраты.План;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ут_ТехническийПроект.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ут_ТехническийПроект КАК ут_ТехническийПроект
	               |ГДЕ
	               |	ут_ТехническийПроект.ВнутренняяЗадача = &ВнутренняяЗадача
	               |	И ут_ТехническийПроект.Ссылка <> &ТекСсылка
	               |	И ут_ТехническийПроект.Проведен";
	
	Запрос.УстановитьПараметр("ВнутренняяЗадача", ВнутренняяЗадача);
	Запрос.УстановитьПараметр("ТекСсылка", Ссылка);
	РезЗапроса = Запрос.Выполнить();
	Если Не РезЗапроса.Пустой() Тогда
		
		Выборка = РезЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ШаблонСообщения = НСтр("ru = 'Уже есть %1 с внутренней задачей %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Выборка.Ссылка, ВнутренняяЗадача);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка,,,Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
